package com.mrais.percakapan3bahasa.Activity.Model;

public class ListDataPertanyaanBhsArab {

    public String pertanyaan[] ={
            "اُنْظُْر إَِلَ ال ُّصْوَرةِ ! َم ْن ى ِذهِ، َوَماذَا تَْع َم ُل ؟ ..",
            "فَْوَزان : أَيْ َن يَْع َم ُل الطابِْي ُب، يَا َح َسن ؟\n" +
                    "َح َسن : ُىَو يَْع َم ُل ِ ْفِ",
            "جِّد ْي.... إِ َلَ الَْمْزَرَعِة ِلَِناوُ فَلَّا ٌح",
            "م ْن يَْبِْنِ ال اشَوا ِرَع َوا ْلُْ ُسْوَر ؟ ..",
            "الُِ ْستَاذُ : َماذَا ُِتُ ُّب يَافَِريْد ؟\n" +
                    "فَِريْد : أُِح ُّب أَ ْن أَقَْرأَ الْ ُكتُ َب الْعِْل ِمياةَ َوالَْم َجلَّا ِت ا ِلإ ْسلََِّميّةَ.\n" +
                    "َما ِىَوايَةُ فَِريْد ؟ ...",
            "السؤال لنمرة : ٚ – ٛ\n" +
                    "أَنَا يُْو ُس ُف، أَنَا تِْل ِمْيٌذ ِفِ الَْم ْدَرَسِة الْ ُمتََو ِّسطَِة اْلإ ْسَلَِّمياِة. َوى َذا أَِ ْبِ، ُىَو يَْقَرأُ الَِ ْخبَاَر ِفِ التِّْلَفاِز ُك ال يَْوٍم.\n" +
                    "َوى ِذهِ أُِّم ْي، ِى َي ُمَوظاَفة\n" +
                    "َما ِمْهنَةُ أَِبِ يُْو ُسف ؟ ..",
            "ى ِذهِ أُِّم ْي، ِى َي ُمَوظاَفةٌ.\n" +
                    "َما َمْعَنَ \" ُمَوظاَفة \" ؟",
            "السؤال لنمرة : ٜ – ٕٔ\n" +
                    "أَنَا َعِزيَْزة، أَنَا طَالِبَةٌ ِفِ الَْم ْدَرَسة الْ ُمتََو ِّسطَة ا ِلإ ْسلََِّميَة. أَِ ْبِ طَبِْي ٌب، يَْع َم ُل ِفِ الْ ُم ْستَ ْشَفى ِس ات َسا َعات ِفِ\n" +
                    "الْيَْوم. أُِّم ْي ُمَدِّرَسة ِفِ ا ْلَْاِمَعة إِنُْدْونِْي ِسيَا، ِى َي تَُدِّر ُس الْ ِكْي ِميَاء. َوِمْهنَة أَِخ ْي ُمَوظا ٌف ِفِ الَْم ْصِرف. أَاما أُ ْخِْتِ\n" +
                    "فَُم ِذيَْعة، تَْقَرأُ الَِ ْخبَار ِفِ التِّْلَفاز" +
                    "م ْن يَتََعلا ُم ِفِ الَْم ْدَرَسة الْ ُمتََو ِّسطَة ا ِلإ ْسلََِّمياة ؟",
            "أَيْ َن تَْع َم ُل أُُّم َعِزيَْزة ؟ ...",
            "َم ْن تَْقَرأُ الَِ ْخبَار ِفِ التِّْلَفاز ؟ ..."
    };
    public String pilihanJawaban[][]={
            {"ى ِذهِ بَائَِعةٌ ِى َي تَبِْي ُع اْلَفَواكِوَ َوا ْلُْ َضَ","ى ِذهِ ُمَدِّرَسةٌ ِى َي تَُعلِّ ُم الطُّالَّ َب َو الطاالِبَا ِت","ى ِذهِ فَالَّ َحةٌ ِى َي تَْزَرعُ النابَاتَا ِت","ى ِذهِ َرباةُ اْلبَْي ِت ِى َي تَطْبَ ُخ الطاَعاَم ِفى الَْمطْبَ ُخ"},
            {"الَْم ْدَرَسِة","الْبَْي ِت","الْ ُم ْستَ ْشَفى","ال ُّسْوِق"},
            {"الْ ُم ِذيْ ُع","الَْفلَّا ُح","الْ ُمَهْن ِد ُس","الْ ُمَدِّر ُس"},
            {"الْ ُمَهْن ِد ُ","الَطاابِْي ُب","الْ ُمَدِّر ُس","الَْفلَّا ُح"},
            {"الارْس ُ","الْ ِكتَابَةُ","الِّريَا َضة","الِْقَراءَة"},
            {"ُمَوظا ٌف","م ِذيٌْع","مَدِّر ٌس","شْرِطي"},
            {"polisi","pegawai","arsitek","pedagang"},
            {"أَ ُخْو َعِزيَْزة","أُ ْخ ُت َعِزيَْزة","أَبُْو َعِزيَْزة","عِزيَْزة"},
            {"ِفِ الَْمْزَرَعة","ِفِ الَْم ْصِرف","ِفِ ا ْلَْاِمَعة","ِفِ الْ ُم ْستَ ْشَفى"},
            {"أَبُو َعِزيَْزة","أُُّم َعِزيَْزة","أُ ْخ ُت َعِزيَْزة","أَ ُخو َعِزيَْزة"},
    };
    public String jawabanBenar[]={
            "ى ِذهِ بَائَِعةٌ ِى َي تَبِْي ُع اْلَفَواكِوَ َوا ْلُْ َض",
            "الْبَْي ِت",
            "الْ ُمَدِّر ُس",
            "الَْفلَّا ُح",
            "الِّريَا َضة",
            "ُمَوظا ٌف",
            "pegawai",
            "أُ ْخ ُت َعِزيَْزة",
            "ِفِ ا ْلَْاِمَعة",
            "أَ ُخو َعِزيَْزة"
    };

    public String getPertanyaan(int x) {
        String soal = pertanyaan[x];
        return soal;
    }

    public String getPilihanJawaban1(int x) {
        String jawaban1 = pilihanJawaban[x][0];
        return jawaban1;
    }

    public String getPilihanJawaban2(int x) {
        String jawaban2 = pilihanJawaban[x][1];
        return jawaban2;
    }

    public String getPilihanJawaban3(int x) {
        String jawaban3 = pilihanJawaban[x][2];
        return jawaban3;
    }

    public String getPilihanJawaban4(int x) {
        String jawaban4 = pilihanJawaban[x][3];
        return jawaban4;
    }

    public String getJawabanBenar(int x) {
        String jawaban = jawabanBenar[x];
        return jawaban;
    }
}
